In [1]:
#Housing Data Analysis using Pandas

In [2]:
#Importing important libraries
import numpy as np
import pandas as pd

In [3]:
# 1.Read the housingdata.csv file into pandas DataFrame and display first six rows of the DataFrame

house_data=pd.read_csv('housingdata.csv')
data_top=house_data.head(6)
data_top

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
2  100003000.0           AP    2541654          NaN        1   850
3  100004000.0           TN     321321            1      NaN   700
4          NaN           TN  589465645            3        2  1600
5  100006000.0           TN   65465466          NaN        1   800

In [4]:
# 2. Display the column names and row index in separate cells.

In [5]:
# 2. a) Display the column names
col_names=list(house_data.columns.values)
print("Columns names are :- ",col_names)

Columns names are :-  ['PID', 'STATE', 'PRICE', 'NUM_BEDROOMS', 'NUM_BATH', 'SQ_FT']

In [6]:
# 2. b) Row Index
for i in house_data.index:
    print(i,end=' ')

0 1 2 3 4 5 6 7 8

In [7]:
#3 a) How many numbers of “STATE” exist in the dataset. Hint: use shape
   #b) How many unique states exist in the dataset

# 3 a)
print('No of states in the data set:-',house_data['STATE'].count())
# 3 b)
print('No of unique states in the data set:-',house_data['STATE'].nunique())

No of states in the data set:- 9
No of unique states in the data set:- 6

In [8]:
# 4. Retrieve the list of all NaN/Null/Empty cells in the form of Boolean list
house_data1=house_data.replace(' ',np.nan)
house_data1=house_data.replace('--',np.nan)
house_data1.isna().any()[lambda x: x]

PID             True
NUM_BEDROOMS    True
NUM_BATH        True
SQ_FT           True
dtype: bool

In [9]:
# 5. Drop all rows with N/A,NA,na values in Num_Bedrooms
house_data=house_data.replace('na',np.nan)
house_data.dropna(subset=['NUM_BEDROOMS'],inplace=True)
print('The data without na,Na,N/A in Num_bedrooms')
house_data

The data without na,Na,N/A in Num_bedrooms

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
3  100004000.0           TN     321321            1      NaN   700
4          NaN           TN  589465645            3        2  1600
6  100007000.0        ASSAM    3222321            2   HURLEY   950
7  100008000.0           HP      23131            1        1   NaN

In [17]:
# 6. Replace the NaN and String entries in Num_Bath with previous entry
house_data.replace('HURLEY','NaN',inplace=True)
house_data.loc[:,'NUM_BATH'] = house_data.loc[:,'NUM_BATH'].ffill()
house_data

,PID,STATE,PRICE,NUM_BEDROOMS,NUM_BATH,SQ_FT,NUM_STORE
0,100001000.0,MP,321654,3,1,1000.0,1
1,100002000.0,MAHARASHTRA,21325,3,1.5,1062.5,1
3,100004000.0,TN,321321,1,1.5,700.0,1
4,NaN,TN,589465645,3,2,1600.0,1
6,100007000.0,ASSAM,3222321,2,NaN,950.0,1
7,100008000.0,HP,23131,1,1,1062.5,1

In [11]:
# 7. Replace the empty values in “SQ_FT” with the mean of the all entries.
house_data.replace('--','NaN',inplace=True)
house_data['SQ_FT'] = house_data['SQ_FT'].astype(float)
mean_value=house_data['SQ_FT'].mean()
house_data['SQ_FT'].fillna(value=mean_value,inplace=True)
house_data

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0           MP     321654            3        1  1000.0
1  100002000.0  MAHARASHTRA      21325            3      1.5  1062.5
3  100004000.0           TN     321321            1      1.5   700.0
4          NaN           TN  589465645            3        2  1600.0
6  100007000.0        ASSAM    3222321            2      NaN   950.0
7  100008000.0           HP      23131            1        1  1062.5

In [12]:
# 8. What is the sum of SQ_FT of all entries in the dataset.
house_data['SQ_FT'] = house_data['SQ_FT'].astype(float)
print('Sum of SQ_FT for all entries :- ',house_data['SQ_FT'].sum())

Sum of SQ_FT for all entries :-  6375.0

In [18]:
# 9. Add a new column “NUM_STORE” and with all the values as 1 for all rows
house_data=house_data.assign(NUM_STORE=1)
house_data

,PID,STATE,PRICE,NUM_BEDROOMS,NUM_BATH,SQ_FT,NUM_STORE
0,100001000.0,MP,321654,3,1,1000.0,1
1,100002000.0,MAHARASHTRA,21325,3,1.5,1062.5,1
3,100004000.0,TN,321321,1,1.5,700.0,1
4,NaN,TN,589465645,3,2,1600.0,1
6,100007000.0,ASSAM,3222321,2,NaN,950.0,1
7,100008000.0,HP,23131,1,1,1062.5,1

In [14]:
# 10. Create a DataFrame containing all entries of TN state only
house_data1=house_data[house_data['STATE'] =='TN']
house_data1

           PID STATE      PRICE NUM_BEDROOMS NUM_BATH   SQ_FT  NUM_STORE
3  100004000.0    TN     321321            1      NaN   700.0          1
4          NaN    TN  589465645            3        2  1600.0          1

In [17]:
# 14. Create a DataFrame having SQ_FT area greater than 1000 and display the DataFrame
#house_data= house_data.replace('--',0.0)
house_data['SQ_FT'] = house_data['SQ_FT'].astype(float)
house_data2=house_data[house_data['SQ_FT'] > 1000]
house_data2

,PID,STATE,PRICE,NUM_BEDROOMS,NUM_BATH,SQ_FT,NUM_STORE
1,100002000.0,MAHARASHTRA,21325,3,1.5,1062.5,1
4,NaN,TN,589465645,3,2,1600.0,1
7,100008000.0,HP,23131,1,1,1062.5,1

In [20]:
# 15. Create a DataFrame having only first Three columns and First Three rows
house_data3=house_data.iloc[0:3,0:3]
print(house_data3)

           PID        STATE   PRICE
0  100001000.0           MP  321654
1  100002000.0  MAHARASHTRA   21325
3  100004000.0           TN  321321

In [20]:
# 16. Display the state having highest average price per square foot of housing area. Hint: Average of (TotalPrice/Sq_Ft)
house_data['AVG_PRICE_PER_SQFT'] = house_data['PRICE']/house_data['SQ_FT']
house_data.loc[house_data['AVG_PRICE_PER_SQFT'] == house_data['AVG_PRICE_PER_SQFT'].max()]['STATE']

4    TN
Name: STATE, dtype: object